[
  {
    "movie": "Pirates of Caribbean: The Curse of the Black Pearl",
    "updatedDate": "2025-9-07",
    "quotes": [
      {
        "quote": "Jack, it's a fool's errand.",
        "words": [
          {
            "word": "errand",
            "note": "short trip to buy or deliver things."
          }
        ]
      },
      {
        "quote": "What makes you think Barbossa will give up his ship to you? -- Let's just say it's a matter of leverage.",
        "words": [
          {
            "word": "leverage",
            "note": "power to influence people and get the results you want."
          }
        ]
      },
      {
        "quote": "Well, you may tell the captain that I am disclined to acquiesce to his request.",
        "words": [
          {
            "word": "to acquiesce",
            "note": "to accept or agree to something, often unwilingly."
          }
        ]
      },
      {
        "quote": "There's no need to sand on ceremony, no call to impress anyone.",
        "words": [
          {
            "word": "there is no call something",
            "note": "<spoken> used to tell someone that their behavior is wrong and unnecessary."
          }
        ]
      },
      {
        "quote": "All the scatterd pices of the Aztec gold must be restored and blood repaid.",
        "words": [
          {
            "word": "scattered",
            "note": "covering a wide area"
          }
        ]
      },
      {
        "quote": "For too long I've been parched of thirst and unable to quench it.",
        "words": [
          {
            "word": "perched",
            "note": "dried out because of too much heat  quench"
          }
        ]
      },
      {
        "quote": "Do you have the courage and fortitude to follow orders and stay true in the face of danger and almost certain death?",
        "words": [
          {
            "word": "fortitude",
            "note": "bravery when dealing with pain or difficulty, especially over a long period"
          }
        ]
      },
      {
        "quote": "Not a lot's known about Jack before he showed up Tortuga with a mind to find the treasure of the Isla de Muerta.",
        "words": [
          {
            "word": "with a mind to...",
            "note": "someone has a specific plan or ourpose in mind."
          }
        ]
      },
      {
        "quote": "He plays things closer to the vest now.",
        "words": [
          {
            "word": "play it close to the vest",
            "note": "to be reserved, secretive to oneself. to take no risks; be cautious."
          }
        ]
      },
      {
        "quote": "\"There're days out on the venture, the first mate says, \"\"Everything's an equal share. That means the location of the treasure too.\"\" So Jack gives up the bearings.\"",
        "words": [
          {
            "word": "bearings",
            "note": "an understanding of directions and positions that helps you know where you are."
          }
        ]
      },
      {
        "quote": "That night, there was a munity. They marooned Jack on an island left him to die.",
        "words": [
          {
            "word": "marron",
            "note": "to leave someone in a place from which they cannot escape."
          }
        ]
      },
      {
        "quote": "but not before he'd gone mad with the heat.",
        "words": [
          {
            "word": "but not before",
            "note": "at a time eariler than, first than, e.g."
          }
        ]
      },
      {
        "quote": "He waded out into the shallows and waited three days and three nights. till all manner of sea creatures came acclimated to his presence.",
        "words": [
          {
            "word": "wade",
            "note": "to walk through water or other liquid with some effort  acclimate to something"
          }
        ]
      },
      {
        "quote": "Ten years hoarding swag.",
        "words": [
          {
            "word": "hoarding",
            "note": "to collect large amount of something and keep it for yourself. often in a seacret place.  swag"
          }
        ]
      },
      {
        "quote": "What code is Gibbs to keep to if the worst should happen? -- Pirate's code. Any man who falls behind is left behind.",
        "words": [
          {
            "word": "fall behind",
            "note": "to fail to do something fast enogh or on time."
          }
        ]
      },
      {
        "quote": "For ten years we've been tested and tried, and each man here has proved his mettle a hundred times over and a hundred times again!",
        "words": [
          {
            "word": "mettle",
            "note": "ability and determination when competing or doing something difficult bravely and determination  determination"
          }
        ]
      },
      {
        "quote": "disportionate to our crime!",
        "words": [
          {
            "word": "disportionate",
            "note": "too great or too small when compared to something else, or not deserving its importance."
          }
        ]
      },
      {
        "quote": "Every last piece that went astray, we have returnd.",
        "words": [
          {
            "word": "astray",
            "note": "away from the correct path or correct way of doing something."
          }
        ]
      },
      {
        "quote": "Who amoung us has paid the blood sacrifice owed to the heathen gods?",
        "words": [
          {
            "word": "heathen",
            "note": "a person who has no religeion or who belongs to a religion that is not christianity, judaism or msrim"
          }
        ]
      },
      {
        "quote": "And whoes blood must yet be paid? -- Hers! You know the first thing I'm going to do after the curse lifted? Eat a bushel of apples!",
        "words": [
          {
            "word": "lifted",
            "note": "to end a rule or law  bushel"
          }
        ]
      },
      {
        "quote": "Get after her, you feckless pack of ingrates!",
        "words": [
          {
            "word": "feckless",
            "note": "weak in character and lacking determination.  ingrates"
          }
        ]
      },
      {
        "quote": "The oars have gone missing! Find them!",
        "words": [
          {
            "word": "oar",
            "note": "a long pole with a wide, float part at one end, used for rowing a boat."
          }
        ]
      },
      {
        "quote": "When you marooned me on that godforsaken spit of land, you forgot one very important thing, mate.",
        "words": [
          {
            "word": "godforsaken",
            "note": "a gidfirsaken place is not attractive and contains nothing interesting or pleasant."
          }
        ]
      },
      {
        "quote": "What say we run up a flag of truce, I scurry over to the Intercepter, and Inegotiate the return of your medalion?",
        "words": [
          {
            "word": "What say",
            "note": "what do you say  run something up"
          },
          {
            "word": "to raise a flag into the air on a pole or mast.  truce",
            "note": "a short interruption in a war or argument, or an agreement to stop fighting or arguing for a period of time.  scurry"
          }
        ]
      },
      {
        "quote": "Locking him in the brig!",
        "words": [
          {
            "word": "brig",
            "note": "a military prison especually one on a US navy ship"
          }
        ]
      },
      {
        "quote": "We've shallower in the draft, right?",
        "words": []
      },
      {
        "quote": "Can't we lose them amongst those shoals?",
        "words": [
          {
            "word": "shoals",
            "note": "a raised area of sand or rocks under the surface of the water."
          }
        ]
      },
      {
        "quote": "Anything we can afford to lose, see that it's lost!",
        "words": [
          {
            "word": "See that...",
            "note": "to make certain that something happens."
          }
        ]
      },
      {
        "quote": "\"Any of you so much as thinks tha word \"\"parley\"\", I'll have your guts for gaeters!\"",
        "words": [
          {
            "word": "gut",
            "note": "the long tube in the body of a person or animal, through which food moves during the process of digesting food."
          }
        ]
      },
      {
        "quote": "Though it does seem a shame to lose something so fine, don't it lads?",
        "words": [
          {
            "word": "shame",
            "note": "an uncomfotable feeling of guilt or of being ashamed because your own or someone else's bad behavior."
          }
        ]
      },
      {
        "quote": "Perhaps you'll be able to conjure up another miraculous escape. But I dought it. Off you go.",
        "words": [
          {
            "word": "conjure",
            "note": "to make something appear by magic, or as if by magic."
          }
        ]
      },
      {
        "quote": "Seeing as there's two of us, a gentleman would give us a pair of pistols.",
        "words": [
          {
            "word": "Seeing that...",
            "note": "considering or accepting the fact that"
          }
        ]
      },
      {
        "quote": "Last time, the rumrunners used this island as a cache. They came by, and I was able to berter passage off.",
        "words": [
          {
            "word": "barter",
            "note": "to exchange goods for other things rather than for money.  passage"
          }
        ]
      },
      {
        "quote": "Why is the rum gone?  One, because it is a vile drink that turns even the most respectable man into complete scoundrels.",
        "words": [
          {
            "word": "vile",
            "note": "unpleasant, immoral, and unacceptable.  scoundrels"
          }
        ]
      },
      {
        "quote": "Mr. Sparrow, you will accompany these fine man to the helm and provide us with a bearing to Isla de Muerta.",
        "words": [
          {
            "word": "helm",
            "note": "the handle or wheel which controles the direction in which a ship or boat travels"
          }
        ]
      },
      {
        "quote": "\"You will then spend the rest of the voyage contemplating all possible meanings of the phrase \"\"silent as the grave\"\". Do I make myself clear?\"",
        "words": [
          {
            "word": "contemplating",
            "note": "to spend time considering a possible future action, or to considerone partiuler thing for a long time in a serious and quiet way.  silent as the grave"
          }
        ]
      },
      {
        "quote": "Never sat well with Bootstrap waht we did to Jack Sparrow, the mutiny and all. He said it wasn't right with the Code. That's why he sent off a piece of the treasure to you.",
        "words": [
          {
            "word": "sit well",
            "note": "to be something that you agree or are pleased with."
          }
        ]
      },
      {
        "quote": "Last we saw of oI' Bill Turner, he was sinking into the crushing black oblivion of Davy Jone's locker!",
        "words": [
          {
            "word": "oblivion",
            "note": "the state of being unconsious or lacking awareness of what is happening around you."
          }
        ]
      },
      {
        "quote": "Any attempt to storm the caves could turn into an ambush.",
        "words": [
          {
            "word": "ambush",
            "note": "a sudden and surprising attack a person or group by one or more people who had been hiding and waiting for them."
          }
        ]
      },
      {
        "quote": "Nothing I'd lament being rid of.",
        "words": [
          {
            "word": "lament",
            "note": "to express sadness and feeling sorry about something."
          }
        ]
      },
      {
        "quote": "No reason to fret. Just a prick of the finger, a few drops of blood.",
        "words": [
          {
            "word": "fret",
            "note": "to be nerves or worryied.  prick"
          }
        ]
      },
      {
        "quote": "Just hear me out, mate. You order your men to row out to the Dauntless.",
        "words": [
          {
            "word": "row",
            "note": "to cause a boat to move through water by pushing against the water with oars."
          }
        ]
      },
      {
        "quote": "The makings of your very own fleet.",
        "words": [
          {
            "word": "fleet",
            "note": "- a group of ships in a country's navy. - a number of aircraft, buses, cars, or other vehicles under the control of one company or organization."
          }
        ]
      },
      {
        "quote": "Cause you'll the grandest as your flagship, and who's to argue?",
        "words": [
          {
            "word": "flagship",
            "note": "the ship within a group on which the most important officer sails.  to argue someone"
          }
        ]
      }
    ]
  }
]
